In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('./Orders.csv')
df

    Order ID  Order Date CustomerName             State     City
0    B-26055  10-03-2018    Harivansh     Uttar Pradesh  Mathura
1    B-25993  03-02-2018       Madhav             Delhi    Delhi
2    B-25973  24-01-2018  Madan Mohan     Uttar Pradesh  Mathura
3    B-25923  27-12-2018        Gopal       Maharashtra   Mumbai
4    B-25757  21-08-2018     Vishakha    Madhya Pradesh   Indore
..       ...         ...          ...               ...      ...
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

[500 rows x 5 columns]

In [7]:
df.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [8]:
df.tail()

    Order ID  Order Date CustomerName             State     City
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

In [23]:
## Accessing Data from Dataframe
df['CustomerName']

0        Harivansh
1           Madhav
2      Madan Mohan
3            Gopal
4         Vishakha
          ...
495         Ashwin
496         Bhavna
497        Shivani
498        Shubham
499        Monisha
Name: CustomerName, Length: 500, dtype: object

In [25]:
# Display the data types of each column
print("Data Types: \n", df.dtypes)

Data Types:
 Order ID        object
Order Date      object
CustomerName    object
State           object
City            object
dtype: object

In [26]:
# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Statistical summary:
        Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26055  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [29]:
grouped = df.groupby('State')['City'].unique()
grouped

State
Andhra Pradesh                         [Hyderabad]
Bihar                                      [Patna]
Delhi                                      [Delhi]
Goa                                          [Goa]
Gujarat                         [Surat, Ahmedabad]
Haryana                               [Chandigarh]
Himachal Pradesh                           [Simla]
Jammu and Kashmir                        [Kashmir]
Karnataka                              [Bangalore]
Kerala                        [Thiruvananthapuram]
Madhya Pradesh                    [Indore, Bhopal]
Maharashtra                         [Mumbai, Pune]
Nagaland                                  [Kohima]
Punjab                      [Chandigarh, Amritsar]
Rajasthan                        [Udaipur, Jaipur]
Sikkim                                   [Gangtok]
Tamil Nadu                               [Chennai]
Uttar Pradesh        [Mathura, Prayagraj, Lucknow]
West Bengal                              [Kolkata]
Name: City, dtype: object

In [30]:
df.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26055  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [31]:
df.dtypes

Order ID        object
Order Date      object
CustomerName    object
State           object
City            object
dtype: object

In [32]:
## Handling Missing Vales
df.isna()

     Order ID  Order Date  CustomerName  State   City
0       False       False         False  False  False
1       False       False         False  False  False
2       False       False         False  False  False
3       False       False         False  False  False
4       False       False         False  False  False
..        ...         ...           ...    ...    ...
495     False       False         False  False  False
496     False       False         False  False  False
497     False       False         False  False  False
498     False       False         False  False  False
499     False       False         False  False  False

[500 rows x 5 columns]

In [34]:
df.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Length: 500, dtype: bool

In [35]:
df.isnull().any()

Order ID        False
Order Date      False
CustomerName    False
State           False
City            False
dtype: bool

In [36]:
df.isnull().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
dtype: int64

In [37]:
df.fillna(0)

    Order ID  Order Date CustomerName             State     City
0    B-26055  10-03-2018    Harivansh     Uttar Pradesh  Mathura
1    B-25993  03-02-2018       Madhav             Delhi    Delhi
2    B-25973  24-01-2018  Madan Mohan     Uttar Pradesh  Mathura
3    B-25923  27-12-2018        Gopal       Maharashtra   Mumbai
4    B-25757  21-08-2018     Vishakha    Madhya Pradesh   Indore
..       ...         ...          ...               ...      ...
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

[500 rows x 5 columns]

In [ ]:
### Filling missing values with the mean of the column

In [24]:
df.iloc[0][0]

/var/folders/jd/372d0pdn11d0cd5bj68pbg040000gn/T/ipykernel_60726/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'B-26055'

In [22]:
df.at[1,'State']

'Delhi'

In [38]:
## Merging and Joining Dataframes

df1 = pd.read_csv('./Details.csv')
df2 = pd.read_csv("./Orders.csv")

In [42]:
# merge dataframes

df = pd.merge(df2, df1)

In [43]:
df.head()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,EMI
1,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,Credit Card
2,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,COD
3,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,UPI
4,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,COD

In [48]:
df.tail()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
1495,B-25742,03-08-2018,Ashwin,Goa,Goa,11,-8,2,Clothing,Skirt,UPI
1496,B-26088,26-03-2018,Bhavna,Sikkim,Gangtok,11,5,2,Clothing,Hankerchief,UPI
1497,B-25707,01-07-2018,Shivani,Maharashtra,Mumbai,8,-6,1,Clothing,Stole,COD
1498,B-25758,22-08-2018,Shubham,Himachal Pradesh,Simla,8,-2,1,Clothing,Stole,COD
1499,B-26095,28-03-2018,Monisha,Rajasthan,Jaipur,6,1,1,Clothing,Kurti,UPI

In [49]:
df.dtypes

Order ID        object
Order Date      object
CustomerName    object
State           object
City            object
Amount           int64
Profit           int64
Quantity         int64
Category        object
Sub-Category    object
PaymentMode     object
dtype: object

In [50]:
df.describe()

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000

In [52]:
df.isna().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64

In [62]:
grouped_mean = df.groupby('State')['Profit'].sum().sort_values(ascending=False)
print(grouped_mean)

State
Madhya Pradesh       7382
Maharashtra          6963
Uttar Pradesh        3358
Gujarat              3001
Tamil Nadu           2602
Kerala               2435
West Bengal          2074
Delhi                1958
Bihar                1787
Himachal Pradesh     1662
Punjab               1571
Haryana              1325
Karnataka             449
Sikkim                401
Goa                   350
Jammu and Kashmir     208
Nagaland               40
Andhra Pradesh       -280
Rajasthan            -323
Name: Profit, dtype: int64

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1500 non-null   object
 1   Order Date    1500 non-null   object
 2   CustomerName  1500 non-null   object
 3   State         1500 non-null   object
 4   City          1500 non-null   object
 5   Amount        1500 non-null   int64
 6   Profit        1500 non-null   int64
 7   Quantity      1500 non-null   int64
 8   Category      1500 non-null   object
 9   Sub-Category  1500 non-null   object
 10  PaymentMode   1500 non-null   object
dtypes: int64(3), object(8)
memory usage: 129.0+ KB

In [65]:
print(df.duplicated().sum())

0

In [68]:
df.shape[1]

11

In [69]:
df.drop(columns = ['Order ID', 'Order Date'], inplace=True)

In [70]:
df.head()

,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,EMI
1,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,Credit Card
2,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,COD
3,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,UPI
4,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,COD

In [71]:
import numpy as np
df.describe(exclude=np.number)

       CustomerName           State    City  Category Sub-Category PaymentMode
count          1500            1500    1500      1500         1500        1500
unique          336              19      25         3           17           5
top        Abhishek  Madhya Pradesh  Indore  Clothing        Saree         COD
freq             21             314     248       949          211         684

In [72]:
df['Category'].nunique()

3

In [73]:
df['Category'].value_counts()

Category
Clothing       949
Electronics    308
Furniture      243
Name: count, dtype: int64

In [74]:
df['Sub-Category'].nunique()

17

In [75]:
df['Sub-Category'].value_counts()

Sub-Category
Saree               211
Hankerchief         197
Stole               192
Phones               83
Electronic Games     79
Bookcases            79
T-shirt              77
Chairs               74
Printers             74
Furnishings          73
Accessories          72
Shirt                69
Skirt                64
Leggings             53
Kurti                47
Trousers             39
Tables               17
Name: count, dtype: int64

In [76]:
df['PaymentMode'].nunique()

5

In [77]:
df['PaymentMode'].value_counts()

PaymentMode
COD            684
UPI            331
Debit Card     202
Credit Card    163
EMI            120
Name: count, dtype: int64